---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionLProfileWithLips
source: html/9d68a554-1fc6-c633-e875-05dc9b96c899.htm
---
# StructuralSectionLProfileWithLips Members

Creates a new instance of Structural Section L Profile With Lips shape with the associated set of parameters,
 used to attach to structural element.